# Titanic 데이터 분석

## (1) 파일 불러오기

In [1]:
import pandas as pd
import numpy as np

In [2]:
DIR = '../Data/'
FILE = 'titanic.csv'

titanicDF = pd.read_csv(DIR + FILE)

## (2) 데이터 확인

In [3]:
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
titanicDF.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanicDF.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [6]:
titanicDF.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

## (3) 데이터 전처리

### (3-1) 데이터 정제

#### (3-1-1) 결측치 처리

In [7]:
titanicDF.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
titanicDF['Cabin'] = titanicDF['Cabin'].fillna('dontknow')
titanicDF['Age'] = titanicDF['Age'].fillna(titanicDF['Age'].interpolate())
titanicDF['Embarked'] = titanicDF['Embarked'].fillna(method='ffill')

In [9]:
titanicDF.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

#### (3-1-2) 중복값 처리

In [10]:
titanicDF.duplicated(subset='Name').sum()

0

### (3-2) 데이터 표준화

In [12]:
titanicDF['Age'] = titanicDF['Age'].astype('int')

In [15]:
ageSurvive = titanicDF[['Age', 'Survived']]
ageSurvive

     Age  Survived
0     22         0
1     38         1
2     26         1
3     35         1
4     35         0
..   ...       ...
886   27         0
887   19         1
888   22         0
889   26         1
890   32         0

[891 rows x 2 columns]